#include <iostream> //добавяне на библиотека iostream без, кояти не може да бъде компилирана програмата
#include <cstdlib> //добавяне на библиотека cstdlib, без която генератора за случаен избор на число не може да работи
#include <ctime> //добавяне на библиотека ctime
using namespace std;

int main()
{
    srand(time(0)); //създаване на генератор за избиране на скучайно число
    cout << "Guess My Number Game\n\n"; //появяване на надпис, който съобщава, че играта е за познаване на числа- Guess My Number Game; създаване на празен ред след това
    int mini, maxi; //създаване на променливи, чрез които да се създадат граници за генератора на случайно число
    cout << "Type the maximum number for the game : \n\n"; // извеждане на надписа "Type the maximum number for the game :", с който подканят човека да въведе горна граница за генератора
    cin >> maxi; cout<<"\n"; //даване на стойност на променливата, която ще служи за горна граница на генератора
    cout << "Type the minimum number for the game : \n\n"; // извеждане на надписа "Type the minimum number for the game :", с който подканят човека да въведе долна граница за генератора
    cin >> mini; cout<<"\n"; //даване на стойност на променливата, която ще служи за долна граница на генератора
    int num = rand() % (maxi - mini + 1) + mini; //създаване на променлива, която да вземе случайната цифра на гератора; въвеждане на граници на случайно избраното число, които в случая са между въведените от човека по-рано граници
    int guess = 0, broi=0; //създаване на променливите guess и broi, които ще бъде използвана за опитите на човека, да познае случайно генерираното число, и за отчитане на броя опити, които му е отнел, и задаването и на начална стойност равна на 0 на променливите
    while (guess != num) { //действието в оператора while, ще се извършва докато стойността, на зададената променлива guess-нашето предположение, не стане разва на случайно генерираното число
        cout << "Enter a guess between " << mini << " and  "<< maxi << ": "; // извеждане на надписа , с които човекът пита за първото ни предположение, в дадените граници
        cin >> guess; cout<<"\n"; // въвеждане на първа стойност за променливата guess, която да служи за наш първи опит в играта
        broi++; //вдигане на броя на опитите, които сме използвали за познаването
        if (guess == 0) { //действиятa в оператора if, ще се извършват в случай, че нашето предположение е равно на 0
            cout << "End of the game, you can't type 0!\n\n" ; // ще се изведе надписът "End of the game, you can't type 0!"
            break; //край на играта
        } //затваряне на скобата if
        if (guess > num) { //действиятa в оператора if, ще се извършват в случай, че нашето предположение е по-голямо от генерираното число
            cout << "Too high!\n\n"; //извеждане на надписа "Too high!" , който ни съобщава, че нашето число е твърде високо
        } //затваряне на скобата if
        if (guess < num) //действиятa в оператора if, ще се извършват в случай, че нашето предположение е по-малко от генерираното число
            { //отваряне на скобaтa на  if
                cout << "Too low!\n\n"; //извеждане на надписа "Too low!" , който ни съобщава, че нашето число е твърде ниско
            } //затваряне на скобaтa на if
        if (guess == num) { //действиятa в оператора if, ще се извършват в случай, че нашето предположение не е нито по-голямо нито по-малко от генерираното число, следователно случая, който числата съвпаддат, значи сме познали генерираното число
            cout << "\nCorrect! You got it in with " << broi<< " guesses !" ; //извеждане на надписа "Correct! You got it in with ", който съобщава, че сме успяли да познаем числото и това с колко опита сме успяли
        } //затваряне на скобата if
    } //затваряне на скобата на while

    return 0;
}
